SET NAMES 'utf8';
DROP DATABASE IF EXISTS meishi;
CREATE DATABASE meishi CHARSET=UTF8;
USE meishi;

CREATE TABLE ms_dish(
    did INT PRIMARY KEY AUTO_INCREMENT,
    name VARCHAR(64),
    price FLOAT(6,2),
    img_sm VARCHAR(64),
    img_lg VARCHAR(64),
    detail VARCHAR(2048),
    material VARCHAR(2048)
);
INSERT INTO ms_dish(did,img_sm,img_lg,name,price,material,detail) VALUES
(   null,
    'course/11-s.jpg',
    'course/11.jpg',
    '耳子莴笋炒肉片',
    15,
    '猪肉、黒木耳、莴笋、盐、味精、醋、豆粉',
    '黑木耳有滋润强壮，润肺补脑，轻身强志，和血养荣，补血活血，镇静止痛等功效，是天然的滋补剂。木耳能治疗痔疮出血、寒湿性腰腿疼痛等症。莴笋有保健作用，降血压，利尿通乳，宽肠通便。猪肉含蛋白质高。'
),

(   null,
    'course/2-s.jpg',
    'course/2.jpg',
    '腊肠鸡蛋炒饭',
    16.5,
    '米、香肠、葱花、蒜、鸡蛋、玉米青豆胡萝卜、生抽、蚝油',
    '绝对绝对绝对是超级美味吃到欲罢不能的超级炒饭！！！'
),
(   null,
   'course/3-s.jpg',
    'course/3.jpg',
    '莲藕焖牛肉',
    32,
    '卤牛肉、莲藕、生抽、盐、洋葱、黑胡椒粉、香葱',
    '秋冬季节的莲藕粉粉糯糯，用来煨汤或者炖煮肉类都是非常不错的。天冷了，吃一锅牛肉浑身暖暖的。'
),
(   null,
    'course/4-s.jpg',
    'course/4.jpg',
    '火腿白菜炒花干',
    12.5,
    '白菜、花干、火腿、油、盐、生抽',
    '秋菜上市，萝卜白菜比比皆是。白菜锌含量比较高，是植物性食物尤其是蔬菜当中锌含量较高的品种，锌对生长发育、免疫功能、物质代谢和生殖功能等均有重要作用。缺锌后食欲不佳，而白菜有促进食欲的作用，一方面来自于所含的有机硫化合物，同时与白菜锌含量较高也有关系。白菜中的膳食纤维含量都很高，经常进食萝卜白菜，可预防因动物性食物过量而导致的营养性疾病。'
),
(   null,
    'course/5-s.jpg',
    'course/5.jpg',
    '椒香茶菇虾',
    36,
    '虾、茶树菇、细香葱、香菜、蒜、姜、食油、干辣椒、食盐、料酒、生抽、高汤、白糖、白芝麻',
    '茶树菇干和鲜虾一同烹煮，地鲜和海鲜的完美融合，用最简单的方法做出它们的原鲜味儿,汤头让茶菇虾更加吸引人的味蕾。'
),
(   null,
    'course/1-s.jpg',
    'course/1.jpg',
    '秋葵蒸蛋羹',
    19,
    '秋葵、鸡蛋、温水、盐、生抽、香油',
    '秋葵嫩荚含有丰富的果胶、膳食纤维，其果胶的粘稠状态是植物界非常少见的，膳食纤维的占比及其中可溶性膳食纤维占比均是植物中非常高的。
秋葵蒸蛋羹，一款非常适合儿童和老人食用的菜肴。'
),
(   null,
    'course/6-s.jpg',
    'course/6.jpg',
    '宫保虾仁',
    25,
    '虾、核桃、红尖椒、尖椒、食盐、醋、姜、蒜、八角、花椒、生抽、淀粉、大葱、鸡蛋清、辣椒、白糖',
    '一道非常有名的四川风味菜肴，这道“宫保虾仁”红而不辣、辣而不猛、香辣味浓、肉嫩味鲜，不仅色泽艳丽，而且非常美味可口，是不是很想尝尝呢。'
),
(   null,
    'course/7-s.jpg',
    'course/7.jpg',
    '培根香菇意面',
    13.5,
    '意大利面、培根、蒜薹、香菇、葱、姜、橄榄油、黑胡椒、芝士粉',
    '极其简单的配料，却能给人极致的味觉享受，培根、香菇和黑胡椒交织出一种令人惊喜的味道，让人迫切的想去吃下一口！'
),
(   null,
    'course/8-s.jpg',
    'course/8.jpg',
    '黄焖鸡',
    28,
    '鸡肉、土豆、胡萝卜、红椒、青椒、花椒、大蒜、香菇、姜、干椒、水淀粉、老抽、白芝麻',
    '主要食材是鸡腿肉，配以青椒、香菇等焖制而成，味道美妙，具有肉质鲜美嫩滑的特点，入口爽滑弹牙，汤汁鲜美，含有的热量是比较高的，可以说是老少皆宜的美食。黄焖鸡的鸡汁经过特有的烹饪方式，可以说自成一道独特风味，鲜香扑鼻，让人胃口大开。'
),
(   null,
    'course/9-s.jpg',
    'course/9.jpg',
    '蒜泥白肉',
    22.5,
    '五花肉、盐、油辣椒、熟白芝麻、大蒜、生姜、大葱、香葱、八角、花椒粒、料酒、细砂糖',
    '蒜泥白肉，属川菜系，口味鲜美，营养丰富，蒜味儿浓郁，肥而不腻。蒜所含的蒜素与肉特别是瘦肉中所含的维生素B1一经结合，就会使维生素B1的原有水溶性一变而为脂溶性，使它能很容易地通过我们身体内的各种膜，并使它被吸收的效率上升几倍。'
),
(   null,
    'course/10-s.jpg',
    'course/10.jpg',
    '粉蒸肉',
    20,
    '五花肉、蒸肉粉、老抽、生抽、料酒、生姜、蒜子',
    '糯而清香，酥而爽口，有肥有瘦，红白相间，嫩而不糜，米粉油润，五香味浓郁。'
),

(   null,
    'course/12-s.jpg',
    'course/12.jpg',
    '番茄炒蛋',
    12,
    '西红柿、鸡蛋、色拉油、食盐、植物油',
    '西红柿含有丰富的胡萝卜素、维生素C和B族维生素，鸡蛋含有大量的维生素和矿物质及有高生物价值的蛋白质，营养搭配合理，色泽鲜艳，口味宜人，爽口、开胃，深受大众喜爱，其营养价值丰富，具有营养素互补的特点以及健美抗衰老的作用'
),
(   null,
    'course/13-s.jpg',
    'course/13.jpg',
    '莴笋炒韭菜',
    14.5,
    '韭菜、莴笋、胡萝卜、盐',
    '韭菜和莴笋的清香是口味上比较还原自然，用胡萝卜做颜色点缀，增加了整份菜的色调'
);

##SELECT * FROM ms_dish;

CREATE TABLE ms_order(
    oid INT PRIMARY KEY AUTO_INCREMENT,
    phone VARCHAR(16),
    user_name VARCHAR(16),
    sex INT,    /*1:男  2:女*/
    order_time LONG,
    addr VARCHAR(256),
    did INT,
    order_num INT
);
CREATE TABLE ms_user(
    uid INT PRIMARY KEY AUTO_INCREMENT,
    phone VARCHAR(16),
    user_name VARCHAR(16),
    sex INT,    /*1:男  2:女*/
    addr VARCHAR(256),
    pwd VARCHAR(16),
    ptime datetime,
    pip VARCHAR(16)
);
INSERT INTO ms_order(oid, phone,user_name,sex,order_time,addr,did,order_num) VALUES
(NULL,'13501234567','123',2,1445154859209,'东城中路103号',3,101),
(NULL,'13501234567','123',2,1445254959209,'东城中路103号',2,102),
(NULL,'13501234567','123',2,1445354959209,'东城中路103号',5,103);

##SELECT * FROM ms_order;